
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7681855300)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_service_account.frontend-sa
* Update
  * google_artifact_registry_repository.artifact-repository


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_service_account.frontend-sa will be created
  + resource "google_service_account" "frontend-sa" {
      + account_id   = "frontend-sa"
      + disabled     = false
      + display_name = "frontend"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "gig-japan-398904"
      + unique_id    = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":27,"Program":"tfcmt","SHA1":"63fba0e489e07ab970cb0927cef08fbe7666cd9d","Vars":{},"WorkflowName":"iaac_plan"} -->